#格式控制  1       2    3       4       5                    6     7  8                          9                                       10      11                                                              
#  "{引导字符序号  :  填充字符 对齐方式 槽的宽度               ,      . 精度                       类型                               }".format("要处理的字符")
#                ^^^  默认空格  ^^^^^
#               引导符号         <左(默认) >右 ^居中 数字千位分隔符 小数精度或字符串输出长度    整数(b,c,d,o,x,X) 浮点数(e,E,f,%)
#                                                                                          b二进制,c输出Unicode,d十进制,o八进制,xX大/小写十六进制
#                                                                                          eE大/小写科学计数法,f浮点数小数,%百分数格式
print("{0:b} {0:c} {0:d} {0:o} {0:x} {0:X}".format(111))
print("{:+^20}".format("1"))
print("{0:e} {0:E} {0:,.2f} {0:,%} ".format(9999.00))